In [1]:
import pandas as pd
import numpy as np

In [2]:
nino34_df = pd.read_excel('PALMOIL_NINO.xlsx', sheet_name = 'Nino3.4')

In [ ]:
nino34_df.head()

In [ ]:
list(nino34_df.columns.values)[1:]

In [3]:
nino34 = pd.melt(nino34_df, id_vars=['year'], value_vars=list(nino34_df.columns.values)[1:], var_name='month', value_name='nino34')

In [4]:
nino34.head()

   year month  nino34
0  1950     1   24.55
1  1951     1   25.24
2  1952     1   26.67
3  1953     1   26.74
4  1954     1   26.98

In [5]:
nino34['DATE'] = pd.to_datetime(nino34[['year', 'month']].assign(DAY=1))

In [6]:
nino34.head()

   year month  nino34       DATE
0  1950     1   24.55 1950-01-01
1  1951     1   25.24 1951-01-01
2  1952     1   26.67 1952-01-01
3  1953     1   26.74 1953-01-01
4  1954     1   26.98 1954-01-01

In [7]:
palm = pd.read_excel('PALMOIL_NINO.xlsx', sheet_name = 'PALMOIL')

In [8]:
palm.head()

        DATE   PPOILUSDM
0 1990-01-01  230.555951
1 1990-02-01  223.945027
2 1990-03-01  236.340508
3 1990-04-01  220.639566
4 1990-05-01  232.208682

In [9]:
nino34.sort_values(by='DATE', inplace=True)

In [10]:
nino34

     year month  nino34       DATE
0    1950     1   24.55 1950-01-01
71   1950     2   25.06 1950-02-01
142  1950     3   25.87 1950-03-01
213  1950     4   26.28 1950-04-01
284  1950     5   26.18 1950-05-01
..    ...   ...     ...        ...
567  2020     8   26.26 2020-08-01
638  2020     9   25.89 2020-09-01
709  2020    10   25.46 2020-10-01
780  2020    11   25.28 2020-11-01
851  2020    12   25.44 2020-12-01

[852 rows x 4 columns]

In [12]:
df = palm.merge(nino34, how='inner', on='DATE')

In [13]:
df.head()

        DATE   PPOILUSDM  year month  nino34
0 1990-01-01  230.555951  1990     1   26.56
1 1990-02-01  223.945027  1990     2   26.96
2 1990-03-01  236.340508  1990     3   27.33
3 1990-04-01  220.639566  1990     4   27.90
4 1990-05-01  232.208682  1990     5   28.02